index=vm sourcetype IN ("vmware:esxlog:envoy-access","vmware:esxlog:perfcharts-localhost_access")
| rex field=downstream_remote_addr "^(?<src_ip>[^:]+)"
| where NOT (cidrmatch("10.10.10.175/32", src_ip) OR cidrmatch("10.10.21.0/24", src_ip))
| rex field=_raw "\s(?<http_method>GET|POST)\s+(?<full_uri>\S+)"
| rex field=full_uri "(?<uri_path>[^?]+)\?(?<query_params>.+)"
| where match(uri_path, "(?i)\.(jsp|jspx|php|aspx)$")
| rex field=query_params "=.(?<b64>[A-Za-z0-9+/_\-]{20,}={0,2})(?:&|$)"
| where isnotnull(b64)
| decrypt field=b64 b64()
| where match(decrypted, "(?i)(/bin/sh|/bin/bash|2>&1|whoami|/etc/passwd|wget |curl |\.\./)")
| table _time, src_ip, http_method, uri_path, b64, decrypted
